---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient1Slab
source: html/6b11a705-d606-7718-ef8f-3fcde8dd9382.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient1Slab Property

"Primary Bar - End Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndHookOrient1Slab { get; }
```